<?php

/**
 * @author RonyLee <RonyLee.Lyz@gmail.com>
 * @date   2017/6/13
 */


/**
 * 配置短信网关
 */

return [

    /**
     * 开关
     */
    'on_off' => 'on',

    /**
     * HTTP 请求的超时时间（秒）
     */
    'timeout' => 5.0,

    /**
     * 默认发送配置
     */
    'default' => [
        // 默认网关，若发送失败，按顺序轮询
        'gateways' => [
            'haobo'
        ],
    ],

    /**
     * 可用的网关配置
     */
    'gateways' => [
        // 阿里大于配置暂时以游学院的帐号为例
        'alidayu' => [
            'app_key' => '23432925',
            'secret_key' => 'ea3f749a2b3cd8eaee1b7c9b6a961679',
            'templates' => [
                'SMS_13075120' => '您的验证码为：${code}，本次短信15分钟有效。',
                'SMS_13110071' => '您本次的动态登录密码为：${code}，本次短信15分钟有效。',
                'SMS_13260620' => '验证码为：${code}，您正在付款购买商品“${product}”，本次短信15分钟有效。',
                'SMS_13200685' => '亲爱的${nickname}，恭喜您的“${product}”轮候订单获得最新名额，请于48小时内完成付款，否则本订单及名额将自动失效，请把握机会。如有疑问请致电：4000-2838-65 ，感谢您的支持！',
                'SMS_13255550' => '亲爱的${nickname}，手机号码也可以登录游学院 ，您的初始密码为：${password}。感谢您的支持！',
                'SMS_13185666' => '尊敬的${nickname}，恭喜您的“${product}”订单已提交，请于${time}小时内完成付款，否则本订单及名额将自动失效，请把握机会。 如有疑问请致电：4000-2838-65 ，感谢您的支持！',
                'SMS_13220630' => '尊敬的${nickname}，您的订单已经提交，如于截止报名日${deadline}前本线路仍未成团，我们将在3个工作日内退还全款至您的支付账户，敬请留意。如有疑问请致电：4000-2838-65 ，感谢您的支持！',
                'SMS_13255629' => '尊敬的${nickname}，您的“${product}”之旅已经成团，如果您还未完善您的游客信息，请登录网站 www.yxylife.com 或者登录微信公众号完善。',
                'SMS_13195739' => '亲爱的${nickname}，您的“${product}”之旅已经支付成功，如果您还未完善您的游客信息，请登录网站 www.yxylife.com 或者登录微信公众号完善。',
                'SMS_13225711' => '尊敬的${nickname}，我们很抱歉的通知您，您已付款的“${product}”因未达最低报名人数，无法成团。我们将在3个工作日内退还全款至您的支付账户，敬请留意。如有疑问请致电：4000-2838-65 ，感谢您的支持！'
            ]
        ],
        'haobo' => [
            'account' => '10690095',
            'password' => 'Mei2016',
        ],
    ],

    /**
     * 产品配置
     */
    'product' => [
        '1' => [
            'id' => 1,
            'sign_name' => 'POCO摄影'
        ],
        '2' => [
            'id' => 2,
            'sign_name' => '游学院'
        ]
    ],

    /**
     * 返回码
     */
    'code' => [
        '0' => 'success', // 发送成功
        '1001' => 'invalid mobile', // 不合法手机号码
        '1002' => 'invalid sign', // 不合法签名
        '1003' => 'invalid template', // 不合法模板
        '1004' => 'invalid content', // 不合法内容
        '1005' => 'invalid account', // 不合法帐号
        '1006' => 'invalid password', // 不合法密码
        '1007' => 'invalid Params', // 不合法参数
        '1101' => 'amount no enough', // 余额不足
        '1102' => 'out of service', // 服务停机
        '1201' => 'ip limit', // IP频率限制
        '1202' => 'number limit', // 号码数量限制
        '1203' => 'mobile limit', // 号码频率限制
        '1301' => 'other error', // 其它错误
    ],


];